[
  
   {
      "name":"My First App",
      "description":"Welcome to Android application development! Building Your First App This app will teaches you how to build your first Android app. You will learn how to create an Android project with Android Studio .You will also learn some fundamentals of Android app design, including how to build a simple user interface and handle user input. Before you start, download and install Android Studio. Creating an Android Project This lesson shows you how to create a new Android project with Android Studio and describes some of the flles in the project. 1:- In Android Studio, create a new project: -> If you don’t have a project opened, in the Welcome to Android Studio Window, click Start a new Android Studio project. -> If you have a project opened, select FileNew file > New Project. 2:- In the New Project screen, enter the following values: -> Application Name: My First App -> Company Domain: xyz.com Android Studio fills in the package name and project location for you, but you can edit these if you’d like. 3:- Click N ext. 4:- In the Target Android Devices screen, keep the default values and click Next. The Minimum Required SDK is the earliest version of Android that your app supports, which is indicated by the API level. To support as many devices as possible, you should set this to the lowest version available that allows your app to provide its core feature set. If any feature of your app is possible only on newer versions of Android and it’s not critical to the core feature set, enable that feature only when running on the versions that support it. 5:- In the Add an Activity to Mobile screen, select Empty Activity and click N ext. 6:- In the Customize the Activity screen, keep the default values and click Finish. After some processing, Android Studio opens and displays a Hello World app with default files. You will add functionality to some of these files in the following lessons. Now take a moment to review the most important tiles. First, he sure that the Project window is open (select View > Tool Windows > Project) and the Android View is selected from the drop-down list at the top. app > java > com.examplemyiirstapplication > MainActiVity.java This file appears in Android Studio after the New Project Wizard finishes. It contains the class deiinition for the activity you created earlier. When you build and run the app, the Activity starts and loads the layout file that says Hello World! app > res > layout > activity_main.xml This XML tile deiines the layout of the activity and contains a TeXtVieW element with the text Hello world! . app > manifests > AndroidManifest.xml The manifest iile describes the fundamental characteristics of the app and delines each of its components. You’ll revisit this tile as you follow these lessons and add more components to your app. Gradle Scripts > build.gradle Android Studio uses Gradle to compile and build your app. 






",
      "Rating":"8.54",
      "episode":700,
      "categorie":"Android Development",
      "studio":"Toei Animation",
      "img":"https://i.stack.imgur.com/sbcQD.png"
   },
   {
      "name":"Running Your App",
      "description":"Gol D. Roger was known as the 'Pirate King',the strongest and most infamous being to have sailed the Grand Line. The capture and death of Roger by the World Government brought a change throughout the world. His last words before his death revealed the existence of the greatest treasure in the world, One Piece. It was this revelation that brought about the Grand Age of Pirates, men who dreamed of finding One Piece—which promises an unlimited amount of riches and fame—and quite possibly the pinnacle of glory and the title of the Pirate King.",
      "Rating":"8.54",
      "episode":700,
      "categorie":"Android Development",
      "studio":"Toei Animation",
      "img":"https://i.stack.imgur.com/sbcQD.png"
   },
   {
      "name":"How to Generate Signed Apk",
      "description":"Centuries ago, mankind was slaughtered to near extinction by monstrous humanoid creatures called titans, forcing humans to hide in fear behind enormous concentric walls. What makes these giants truly terrifying is that their taste for human flesh is not born out of hunger but what appears to be out of pleasure. To ensure their survival, the remnants of humanity began living within defensive barriers, resulting in one hundred years without a single titan encounter. However, that fragile calm is soon shattered when a colossal titan manages to breach the supposedly impregnable outer wall, reigniting the fight for survival against the man-eating abominations.",
      "Rating":"8.50",
      "episode":500,
      "categorie":"Android Development",
      "studio":"Wit Studio",
      "img":"https://i.stack.imgur.com/1CPP5.png"
   },
   {
      "name":"Get Started With Publishing",
      "description":"It has been two and a half years since Naruto Uzumaki left Konohagakure, the Hidden Leaf Village, for intense training following events which fueled his desire to be stronger. Now Akatsuki, the mysterious organization of elite rogue ninja, is closing in on their grand plan which may threaten the safety of the entire shinobi world.",
      "Rating":"8.16",
      "episode":70,
      "categorie":"Android Development",
      "studio":"MadhousSatr",
      "img":"https://www.dzineflip.com/wp-content/uploads/2019/11/How-to-Publish-an-App-on-Google-Play-store-1024x576.jpg"
   },
   {
      "name":"Google Developer Console",
      "description":"It has been two and a half years since Naruto Uzumaki left Konohagakure, the Hidden Leaf Village, for intense training following events which fueled his desire to be stronger. Now Akatsuki, the mysterious organization of elite rogue ninja, is closing in on their grand plan which may threaten the safety of the entire shinobi world.",
      "Rating":"8.16",
      "episode":500,
      "categorie":"Android Development",
      "studio":"Madhouse",
      "img":"https://387b72ivq1z3mni0n261y7l1-wpengine.netdna-ssl.com/wp-content/uploads/2017/05/10-7-700x341.png"
   },
   {
      "name":"How to get Users",
      "description":"There are words Violet heard on the battlefield, which she cannot forget. These words were given to her by someone she holds dear, more than anyone else. She does not yet know their meaning.A certain point in time, in the continent of Telesis. The great war which divided the continent into North and South has ended after four years, and the people are welcoming a new generation.",
      "Rating":"8.39",
      "episode":14,
      "categorie":"Android Development",
      "studio":"Android Development",
      "img":"https://miro.medium.com/max/1400/0*2rBrwjxddylWiAsi"
   },
   {
      "name":"How to Earn Money",
      "description":"",
      "Rating":"8.01",
      "episode":12,
      "categorie":"Android Development",
      "studio":"Studio Pierrot",
      "img":"https://www.hiddenbrains.co.uk/wp-content/uploads/2018/01/Earn-Money-768x397.jpg"
   },
   {
      "name":"Advertisement",
      "description":"Asta and Yuno were abandoned at the same church on the same day. Raised together as children, they came to know of the Wizard King—a title given to the strongest mage in the kingdom—and promised that they would compete against each other for the position of the next Wizard King. However, as they grew up, the stark difference between them became evident. While Yuno is able to wield magic with amazing power and control, Asta cannot use magic at all and desperately tries to awaken his powers by training physically.",
      "Rating":"6.55",
      "episode":51,
      "categorie":"Android Development",
      "studio":"Studio Pierrot",
      "img":"https://miro.medium.com/max/1400/1*MeE_NkhQGCgC3dHK99LLXg.jpeg"
   }
   
]
